app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "lookrain"]]
---
  def profile
  	if (User.find_by_username(params[:id]))